----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 24, 32, 32]             648
       BatchNorm2d-2           [-1, 24, 32, 32]              48
              GELU-3           [-1, 24, 32, 32]               0
            Conv2d-4           [-1, 48, 32, 32]           1,152
       BatchNorm2d-5           [-1, 48, 32, 32]              96
              GELU-6           [-1, 48, 32, 32]               0
            Conv2d-7           [-1, 12, 32, 32]           5,184
       BatchNorm2d-8           [-1, 24, 32, 32]              48
              GELU-9           [-1, 24, 32, 32]               0
           Conv2d-10           [-1, 48, 32, 32]           1,152
      BatchNorm2d-11           [-1, 48, 32, 32]              96
             GELU-12           [-1, 48, 32, 32]               0
           Conv2d-13           [-1, 12, 32, 32]           5,184
             botn-14           [-1, 36, 32, 32]               0
      BatchNorm2d-15           [-1, 36, 32, 32]              72
             GELU-16           [-1, 36, 32, 32]               0
           Conv2d-17           [-1, 48, 32, 32]           1,728
      BatchNorm2d-18           [-1, 48, 32, 32]              96
             GELU-19           [-1, 48, 32, 32]               0
           Conv2d-20           [-1, 12, 32, 32]           5,184
      BatchNorm2d-21           [-1, 36, 32, 32]              72
             GELU-22           [-1, 36, 32, 32]               0
           Conv2d-23           [-1, 48, 32, 32]           1,728
      BatchNorm2d-24           [-1, 48, 32, 32]              96
             GELU-25           [-1, 48, 32, 32]               0
           Conv2d-26           [-1, 12, 32, 32]           5,184
             botn-27           [-1, 48, 32, 32]               0
      BatchNorm2d-28           [-1, 48, 32, 32]              96
             GELU-29           [-1, 48, 32, 32]               0
           Conv2d-30           [-1, 48, 32, 32]           2,304
      BatchNorm2d-31           [-1, 48, 32, 32]              96
             GELU-32           [-1, 48, 32, 32]               0
           Conv2d-33           [-1, 12, 32, 32]           5,184
      BatchNorm2d-34           [-1, 48, 32, 32]              96
             GELU-35           [-1, 48, 32, 32]               0
           Conv2d-36           [-1, 48, 32, 32]           2,304
      BatchNorm2d-37           [-1, 48, 32, 32]              96
             GELU-38           [-1, 48, 32, 32]               0
           Conv2d-39           [-1, 12, 32, 32]           5,184
             botn-40           [-1, 60, 32, 32]               0
      BatchNorm2d-41           [-1, 60, 32, 32]             120
             GELU-42           [-1, 60, 32, 32]               0
           Conv2d-43           [-1, 48, 32, 32]           2,880
      BatchNorm2d-44           [-1, 48, 32, 32]              96
             GELU-45           [-1, 48, 32, 32]               0
           Conv2d-46           [-1, 12, 32, 32]           5,184
      BatchNorm2d-47           [-1, 60, 32, 32]             120
             GELU-48           [-1, 60, 32, 32]               0
           Conv2d-49           [-1, 48, 32, 32]           2,880
      BatchNorm2d-50           [-1, 48, 32, 32]              96
             GELU-51           [-1, 48, 32, 32]               0
           Conv2d-52           [-1, 12, 32, 32]           5,184
             botn-53           [-1, 72, 32, 32]               0
      BatchNorm2d-54           [-1, 72, 32, 32]             144
             GELU-55           [-1, 72, 32, 32]               0
           Conv2d-56           [-1, 48, 32, 32]           3,456
      BatchNorm2d-57           [-1, 48, 32, 32]              96
             GELU-58           [-1, 48, 32, 32]               0
           Conv2d-59           [-1, 12, 32, 32]           5,184
      BatchNorm2d-60           [-1, 72, 32, 32]             144
             GELU-61           [-1, 72, 32, 32]               0
           Conv2d-62           [-1, 48, 32, 32]           3,456
      BatchNorm2d-63           [-1, 48, 32, 32]              96
             GELU-64           [-1, 48, 32, 32]               0
           Conv2d-65           [-1, 12, 32, 32]           5,184
             botn-66           [-1, 84, 32, 32]               0
      BatchNorm2d-67           [-1, 84, 32, 32]             168
             GELU-68           [-1, 84, 32, 32]               0
           Conv2d-69           [-1, 48, 32, 32]           4,032
      BatchNorm2d-70           [-1, 48, 32, 32]              96
             GELU-71           [-1, 48, 32, 32]               0
           Conv2d-72           [-1, 12, 32, 32]           5,184
      BatchNorm2d-73           [-1, 84, 32, 32]             168
             GELU-74           [-1, 84, 32, 32]               0
           Conv2d-75           [-1, 48, 32, 32]           4,032
      BatchNorm2d-76           [-1, 48, 32, 32]              96
             GELU-77           [-1, 48, 32, 32]               0
           Conv2d-78           [-1, 12, 32, 32]           5,184
             botn-79           [-1, 96, 32, 32]               0
      BatchNorm2d-80           [-1, 96, 32, 32]             192
             GELU-81           [-1, 96, 32, 32]               0
           Conv2d-82           [-1, 48, 32, 32]           4,608
      BatchNorm2d-83           [-1, 48, 32, 32]              96
             GELU-84           [-1, 48, 32, 32]               0
           Conv2d-85           [-1, 12, 32, 32]           5,184
      BatchNorm2d-86           [-1, 96, 32, 32]             192
             GELU-87           [-1, 96, 32, 32]               0
           Conv2d-88           [-1, 48, 32, 32]           4,608
      BatchNorm2d-89           [-1, 48, 32, 32]              96
             GELU-90           [-1, 48, 32, 32]               0
           Conv2d-91           [-1, 12, 32, 32]           5,184
             botn-92          [-1, 108, 32, 32]               0
      BatchNorm2d-93          [-1, 108, 32, 32]             216
             GELU-94          [-1, 108, 32, 32]               0
           Conv2d-95           [-1, 48, 32, 32]           5,184
      BatchNorm2d-96           [-1, 48, 32, 32]              96
             GELU-97           [-1, 48, 32, 32]               0
           Conv2d-98           [-1, 12, 32, 32]           5,184
      BatchNorm2d-99          [-1, 108, 32, 32]             216
            GELU-100          [-1, 108, 32, 32]               0
          Conv2d-101           [-1, 48, 32, 32]           5,184
     BatchNorm2d-102           [-1, 48, 32, 32]              96
            GELU-103           [-1, 48, 32, 32]               0
          Conv2d-104           [-1, 12, 32, 32]           5,184
            botn-105          [-1, 120, 32, 32]               0
     BatchNorm2d-106          [-1, 120, 32, 32]             240
            GELU-107          [-1, 120, 32, 32]               0
          Conv2d-108           [-1, 60, 32, 32]           7,200
             trs-109           [-1, 60, 16, 16]               0
     BatchNorm2d-110           [-1, 60, 16, 16]             120
            GELU-111           [-1, 60, 16, 16]               0
          Conv2d-112           [-1, 48, 16, 16]           2,880
     BatchNorm2d-113           [-1, 48, 16, 16]              96
            GELU-114           [-1, 48, 16, 16]               0
          Conv2d-115           [-1, 12, 16, 16]           5,184
     BatchNorm2d-116           [-1, 60, 16, 16]             120
            GELU-117           [-1, 60, 16, 16]               0
          Conv2d-118           [-1, 48, 16, 16]           2,880
     BatchNorm2d-119           [-1, 48, 16, 16]              96
            GELU-120           [-1, 48, 16, 16]               0
          Conv2d-121           [-1, 12, 16, 16]           5,184
            botn-122           [-1, 72, 16, 16]               0
     BatchNorm2d-123           [-1, 72, 16, 16]             144
            GELU-124           [-1, 72, 16, 16]               0
          Conv2d-125           [-1, 48, 16, 16]           3,456
     BatchNorm2d-126           [-1, 48, 16, 16]              96
            GELU-127           [-1, 48, 16, 16]               0
          Conv2d-128           [-1, 12, 16, 16]           5,184
     BatchNorm2d-129           [-1, 72, 16, 16]             144
            GELU-130           [-1, 72, 16, 16]               0
          Conv2d-131           [-1, 48, 16, 16]           3,456
     BatchNorm2d-132           [-1, 48, 16, 16]              96
            GELU-133           [-1, 48, 16, 16]               0
          Conv2d-134           [-1, 12, 16, 16]           5,184
            botn-135           [-1, 84, 16, 16]               0
     BatchNorm2d-136           [-1, 84, 16, 16]             168
            GELU-137           [-1, 84, 16, 16]               0
          Conv2d-138           [-1, 48, 16, 16]           4,032
     BatchNorm2d-139           [-1, 48, 16, 16]              96
            GELU-140           [-1, 48, 16, 16]               0
          Conv2d-141           [-1, 12, 16, 16]           5,184
     BatchNorm2d-142           [-1, 84, 16, 16]             168
            GELU-143           [-1, 84, 16, 16]               0
          Conv2d-144           [-1, 48, 16, 16]           4,032
     BatchNorm2d-145           [-1, 48, 16, 16]              96
            GELU-146           [-1, 48, 16, 16]               0
          Conv2d-147           [-1, 12, 16, 16]           5,184
            botn-148           [-1, 96, 16, 16]               0
     BatchNorm2d-149           [-1, 96, 16, 16]             192
            GELU-150           [-1, 96, 16, 16]               0
          Conv2d-151           [-1, 48, 16, 16]           4,608
     BatchNorm2d-152           [-1, 48, 16, 16]              96
            GELU-153           [-1, 48, 16, 16]               0
          Conv2d-154           [-1, 12, 16, 16]           5,184
     BatchNorm2d-155           [-1, 96, 16, 16]             192
            GELU-156           [-1, 96, 16, 16]               0
          Conv2d-157           [-1, 48, 16, 16]           4,608
     BatchNorm2d-158           [-1, 48, 16, 16]              96
            GELU-159           [-1, 48, 16, 16]               0
          Conv2d-160           [-1, 12, 16, 16]           5,184
            botn-161          [-1, 108, 16, 16]               0
     BatchNorm2d-162          [-1, 108, 16, 16]             216
            GELU-163          [-1, 108, 16, 16]               0
          Conv2d-164           [-1, 48, 16, 16]           5,184
     BatchNorm2d-165           [-1, 48, 16, 16]              96
            GELU-166           [-1, 48, 16, 16]               0
          Conv2d-167           [-1, 12, 16, 16]           5,184
     BatchNorm2d-168          [-1, 108, 16, 16]             216
            GELU-169          [-1, 108, 16, 16]               0
          Conv2d-170           [-1, 48, 16, 16]           5,184
     BatchNorm2d-171           [-1, 48, 16, 16]              96
            GELU-172           [-1, 48, 16, 16]               0
          Conv2d-173           [-1, 12, 16, 16]           5,184
            botn-174          [-1, 120, 16, 16]               0
     BatchNorm2d-175          [-1, 120, 16, 16]             240
            GELU-176          [-1, 120, 16, 16]               0
          Conv2d-177           [-1, 48, 16, 16]           5,760
     BatchNorm2d-178           [-1, 48, 16, 16]              96
            GELU-179           [-1, 48, 16, 16]               0
          Conv2d-180           [-1, 12, 16, 16]           5,184
     BatchNorm2d-181          [-1, 120, 16, 16]             240
            GELU-182          [-1, 120, 16, 16]               0
          Conv2d-183           [-1, 48, 16, 16]           5,760
     BatchNorm2d-184           [-1, 48, 16, 16]              96
            GELU-185           [-1, 48, 16, 16]               0
          Conv2d-186           [-1, 12, 16, 16]           5,184
            botn-187          [-1, 132, 16, 16]               0
     BatchNorm2d-188          [-1, 132, 16, 16]             264
            GELU-189          [-1, 132, 16, 16]               0
          Conv2d-190           [-1, 48, 16, 16]           6,336
     BatchNorm2d-191           [-1, 48, 16, 16]              96
            GELU-192           [-1, 48, 16, 16]               0
          Conv2d-193           [-1, 12, 16, 16]           5,184
     BatchNorm2d-194          [-1, 132, 16, 16]             264
            GELU-195          [-1, 132, 16, 16]               0
          Conv2d-196           [-1, 48, 16, 16]           6,336
     BatchNorm2d-197           [-1, 48, 16, 16]              96
            GELU-198           [-1, 48, 16, 16]               0
          Conv2d-199           [-1, 12, 16, 16]           5,184
            botn-200          [-1, 144, 16, 16]               0
     BatchNorm2d-201          [-1, 144, 16, 16]             288
            GELU-202          [-1, 144, 16, 16]               0
          Conv2d-203           [-1, 48, 16, 16]           6,912
     BatchNorm2d-204           [-1, 48, 16, 16]              96
            GELU-205           [-1, 48, 16, 16]               0
          Conv2d-206           [-1, 12, 16, 16]           5,184
     BatchNorm2d-207          [-1, 144, 16, 16]             288
            GELU-208          [-1, 144, 16, 16]               0
          Conv2d-209           [-1, 48, 16, 16]           6,912
     BatchNorm2d-210           [-1, 48, 16, 16]              96
            GELU-211           [-1, 48, 16, 16]               0
          Conv2d-212           [-1, 12, 16, 16]           5,184
            botn-213          [-1, 156, 16, 16]               0
     BatchNorm2d-214          [-1, 156, 16, 16]             312
            GELU-215          [-1, 156, 16, 16]               0
          Conv2d-216           [-1, 78, 16, 16]          12,168
             trs-217             [-1, 78, 8, 8]               0
     BatchNorm2d-218             [-1, 78, 8, 8]             156
            GELU-219             [-1, 78, 8, 8]               0
          Conv2d-220             [-1, 48, 8, 8]           3,744
     BatchNorm2d-221             [-1, 48, 8, 8]              96
            GELU-222             [-1, 48, 8, 8]               0
          Conv2d-223             [-1, 12, 8, 8]           5,184
     BatchNorm2d-224             [-1, 78, 8, 8]             156
            GELU-225             [-1, 78, 8, 8]               0
          Conv2d-226             [-1, 48, 8, 8]           3,744
     BatchNorm2d-227             [-1, 48, 8, 8]              96
            GELU-228             [-1, 48, 8, 8]               0
          Conv2d-229             [-1, 12, 8, 8]           5,184
            botn-230             [-1, 90, 8, 8]               0
     BatchNorm2d-231             [-1, 90, 8, 8]             180
            GELU-232             [-1, 90, 8, 8]               0
          Conv2d-233             [-1, 48, 8, 8]           4,320
     BatchNorm2d-234             [-1, 48, 8, 8]              96
            GELU-235             [-1, 48, 8, 8]               0
          Conv2d-236             [-1, 12, 8, 8]           5,184
     BatchNorm2d-237             [-1, 90, 8, 8]             180
            GELU-238             [-1, 90, 8, 8]               0
          Conv2d-239             [-1, 48, 8, 8]           4,320
     BatchNorm2d-240             [-1, 48, 8, 8]              96
            GELU-241             [-1, 48, 8, 8]               0
          Conv2d-242             [-1, 12, 8, 8]           5,184
            botn-243            [-1, 102, 8, 8]               0
     BatchNorm2d-244            [-1, 102, 8, 8]             204
            GELU-245            [-1, 102, 8, 8]               0
          Conv2d-246             [-1, 48, 8, 8]           4,896
     BatchNorm2d-247             [-1, 48, 8, 8]              96
            GELU-248             [-1, 48, 8, 8]               0
          Conv2d-249             [-1, 12, 8, 8]           5,184
     BatchNorm2d-250            [-1, 102, 8, 8]             204
            GELU-251            [-1, 102, 8, 8]               0
          Conv2d-252             [-1, 48, 8, 8]           4,896
     BatchNorm2d-253             [-1, 48, 8, 8]              96
            GELU-254             [-1, 48, 8, 8]               0
          Conv2d-255             [-1, 12, 8, 8]           5,184
            botn-256            [-1, 114, 8, 8]               0
     BatchNorm2d-257            [-1, 114, 8, 8]             228
            GELU-258            [-1, 114, 8, 8]               0
          Conv2d-259             [-1, 48, 8, 8]           5,472
     BatchNorm2d-260             [-1, 48, 8, 8]              96
            GELU-261             [-1, 48, 8, 8]               0
          Conv2d-262             [-1, 12, 8, 8]           5,184
     BatchNorm2d-263            [-1, 114, 8, 8]             228
            GELU-264            [-1, 114, 8, 8]               0
          Conv2d-265             [-1, 48, 8, 8]           5,472
     BatchNorm2d-266             [-1, 48, 8, 8]              96
            GELU-267             [-1, 48, 8, 8]               0
          Conv2d-268             [-1, 12, 8, 8]           5,184
            botn-269            [-1, 126, 8, 8]               0
     BatchNorm2d-270            [-1, 126, 8, 8]             252
            GELU-271            [-1, 126, 8, 8]               0
          Conv2d-272             [-1, 48, 8, 8]           6,048
     BatchNorm2d-273             [-1, 48, 8, 8]              96
            GELU-274             [-1, 48, 8, 8]               0
          Conv2d-275             [-1, 12, 8, 8]           5,184
     BatchNorm2d-276            [-1, 126, 8, 8]             252
            GELU-277            [-1, 126, 8, 8]               0
          Conv2d-278             [-1, 48, 8, 8]           6,048
     BatchNorm2d-279             [-1, 48, 8, 8]              96
            GELU-280             [-1, 48, 8, 8]               0
          Conv2d-281             [-1, 12, 8, 8]           5,184
            botn-282            [-1, 138, 8, 8]               0
     BatchNorm2d-283            [-1, 138, 8, 8]             276
            GELU-284            [-1, 138, 8, 8]               0
          Conv2d-285             [-1, 48, 8, 8]           6,624
     BatchNorm2d-286             [-1, 48, 8, 8]              96
            GELU-287             [-1, 48, 8, 8]               0
          Conv2d-288             [-1, 12, 8, 8]           5,184
     BatchNorm2d-289            [-1, 138, 8, 8]             276
            GELU-290            [-1, 138, 8, 8]               0
          Conv2d-291             [-1, 48, 8, 8]           6,624
     BatchNorm2d-292             [-1, 48, 8, 8]              96
            GELU-293             [-1, 48, 8, 8]               0
          Conv2d-294             [-1, 12, 8, 8]           5,184
            botn-295            [-1, 150, 8, 8]               0
     BatchNorm2d-296            [-1, 150, 8, 8]             300
            GELU-297            [-1, 150, 8, 8]               0
          Conv2d-298             [-1, 48, 8, 8]           7,200
     BatchNorm2d-299             [-1, 48, 8, 8]              96
            GELU-300             [-1, 48, 8, 8]               0
          Conv2d-301             [-1, 12, 8, 8]           5,184
     BatchNorm2d-302            [-1, 150, 8, 8]             300
            GELU-303            [-1, 150, 8, 8]               0
          Conv2d-304             [-1, 48, 8, 8]           7,200
     BatchNorm2d-305             [-1, 48, 8, 8]              96
            GELU-306             [-1, 48, 8, 8]               0
          Conv2d-307             [-1, 12, 8, 8]           5,184
            botn-308            [-1, 162, 8, 8]               0
     BatchNorm2d-309            [-1, 162, 8, 8]             324
            GELU-310            [-1, 162, 8, 8]               0
          Conv2d-311             [-1, 48, 8, 8]           7,776
     BatchNorm2d-312             [-1, 48, 8, 8]              96
            GELU-313             [-1, 48, 8, 8]               0
          Conv2d-314             [-1, 12, 8, 8]           5,184
     BatchNorm2d-315            [-1, 162, 8, 8]             324
            GELU-316            [-1, 162, 8, 8]               0
          Conv2d-317             [-1, 48, 8, 8]           7,776
     BatchNorm2d-318             [-1, 48, 8, 8]              96
            GELU-319             [-1, 48, 8, 8]               0
          Conv2d-320             [-1, 12, 8, 8]           5,184
            botn-321            [-1, 174, 8, 8]               0
     BatchNorm2d-322            [-1, 174, 8, 8]             348
            GELU-323            [-1, 174, 8, 8]               0
       AvgPool2d-324            [-1, 174, 1, 1]               0
          Linear-325                   [-1, 10]           1,750
          ResDen-326                   [-1, 10]               0
================================================================
Total params: 506,506
Trainable params: 506,506
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 61.14
Params size (MB): 1.93
Estimated Total Size (MB): 63.08
----------------------------------------------------------------
